In [1]:

# Total number of unique schools: COMPLETE
# total students: Complete
# total budget: complete
# average math Score: Complete 
# average reading score: Complete 
# % passing math: Complete
# % passing reading: Complete
# % overall passing

In [2]:
import pandas as pd
from pathlib import Path

In [3]:

load_school_data = Path("Resources/schools_complete.csv")
load_student_data = Path("Resources/students_complete.csv")

In [4]:

Schools_data = pd.read_csv(load_school_data)
students_data = pd.read_csv(load_student_data)

In [5]:
Schools_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
students_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [7]:
Schoolslist_df = pd.merge(students_data,Schools_data, how="left", on=["school_name", "school_name"])
Schoolslist_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [8]:
Schoolslist_df.columns = Schoolslist_df.columns.str.strip()
print(Schoolslist_df.columns)

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [9]:
Schools_df = Schoolslist_df.fillna(0)
Schools_df.count()  
Schools_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [10]:
# DROP THEM DUPLICATES....NOW!!!! PLEASE....and thank you
dupi_drop_df = Schools_df.drop_duplicates(subset=['school_name'])

dupi_drop_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
2917,2917,Amy Jacobs,F,10th,Figueroa High School,85,87,1,District,2949,1884411
5866,5866,Jamie Montgomery,F,12th,Shelton High School,70,91,2,Charter,1761,1056600
7627,7627,Russell Davis,M,10th,Hernandez High School,70,88,3,District,4635,3022020
12262,12262,Heather Wright,F,11th,Griffin High School,79,68,4,Charter,1468,917500
13730,13730,Kelli Anderson,F,10th,Wilson High School,84,71,5,Charter,2283,1319574
16013,16013,Olivia Short,F,11th,Cabrera High School,94,94,6,Charter,1858,1081356
17871,17871,Blake Martin,M,9th,Bailey High School,75,59,7,District,4976,3124928
22847,22847,Daniel Rodriguez,M,11th,Holden High School,86,92,8,Charter,427,248087
23274,23274,Alec Davis,M,9th,Pena High School,91,75,9,Charter,962,585858
24236,24236,Aaron Johnson,M,10th,Wright High School,89,72,10,Charter,1800,1049400
26036,26036,Sherry Jenkins,F,11th,Rodriguez High School,74,81,11,District,3999,2547363
30035,30035,Lisa Casey,F,12th,Johnson High School,87,87,12,District,4761,3094650
34796,34796,Michael Mercado,M,9th,Ford High School,66,94,13,District,2739,1763916
37535,37535,Norma Mata,F,10th,Thomas High School,76,76,14,Charter,1635,1043130

In [11]:
# Total number of unique schools:
school_list = dupi_drop_df["school_name"].count()
school_list

15

In [12]:
# total students: Complete
# total budget: complete
# average math Score: Complete 
# average reading score: Complete 
# % passing math: Complete
# % passing reading: Complete

In [13]:
# total students: Complete
Total_students = Schools_df["Student ID"].nunique()
Total_students

39170

In [14]:
Total_budget = dupi_drop_df["budget"].sum()
Total_budget

24649428

In [15]:
# average math Score: Complete 
avg_Math = Schools_df["math_score"].mean()
avg_Math

78.98537145774827

In [16]:
# average reading score: Complete 
avg_Reading = Schools_df["reading_score"].mean()
avg_Reading

81.87784018381414

In [17]:
 # % passing math: Complete
Pass = 70
pass_math = Schools_df["math_score"] >= Pass
number_passing = pass_math.sum()
pass_Percent = (number_passing / Total_students) * 100

print(pass_Percent)

74.9808526933878

In [18]:
# % passing reading: Complete
pass_reading = Schools_df["reading_score"] >= Pass
read_pass = pass_reading.sum()
read_pass_Percent = (read_pass / Total_students) * 100
print(read_pass_Percent)

85.80546336482001

In [19]:

# Use the following to calculate the percentage of students that passed math and reading
passing_math_reading_count = Schools_df[(Schools_df["math_score"] >= 70) & (Schools_df["reading_score"] >= 70)
].count()["student_name"]
overall_passing_rate = passing_math_reading_count /  float(Total_students) * 100
overall_passing_rate
# % overall passing
print(overall_passing_rate)

65.17232575950983

DISTRICT SUMMARY

In [20]:
# COMPLETE FOR ALL
# total students
# total school budget
# per student budget
# average math score
# average reading Score 
# % passing math
# % passing reading
# % overall passing

In [21]:
#  Lets Make A Dictionary....Shall we?

summary_diction = {
    "Total Schools": [school_list],
    "Total Students": [Total_students],
    "Total Budget": [Total_budget],
    "Average Math Score": [avg_Math],
    "Average Reading Score": [avg_Reading],
    "% Passing Math": [pass_Percent],
    "% Passing Reading": [read_pass_Percent],
    "% Overall Passing": [overall_passing_rate]
}

district_summary = pd.DataFrame(summary_diction)

# Formatting
district_summary["Total Students"] = district_summary["Total Students"].map("{:,}".format)
district_summary["Total Budget"] = district_summary["Total Budget"].map("${:,.2f}".format)

# Display the DataFrame
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

SCHOOL SUMMARY

In [22]:
# Use the code provided to select the type per school from school_data
school_types_df = dupi_drop_df.set_index(["school_name"])["type"]
school_types_df

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [23]:
# Calculate the total student count per school from school_data
per_school_counts = Schools_df.groupby('school_name').size()

per_school_counts_df = per_school_counts.reset_index(name='Number of Students')

print(per_school_counts_df)

              school_name  Number of Students
0      Bailey High School                4976
1     Cabrera High School                1858
2    Figueroa High School                2949
3        Ford High School                2739
4     Griffin High School                1468
5   Hernandez High School                4635
6      Holden High School                 427
7       Huang High School                2917
8     Johnson High School                4761
9        Pena High School                 962
10  Rodriguez High School                3999
11    Shelton High School                1761
12     Thomas High School                1635
13     Wilson High School                2283
14     Wright High School                1800

In [47]:
per_school_budget = dupi_drop_df.groupby('school_name')['budget'].sum().reset_index()

per_school_budget.columns = ['School Name', 'Total Budget']

per_school_capita_df = dupi_drop_df.groupby('type')['budget'].sum().reset_index()

per_school_capita_df.columns = ['District Type', 'Total Budget']

print(per_school_budget)
per_school_capita_df

              School Name  Total Budget
0      Bailey High School       3124928
1     Cabrera High School       1081356
2    Figueroa High School       1884411
3        Ford High School       1763916
4     Griffin High School        917500
5   Hernandez High School       3022020
6      Holden High School        248087
7       Huang High School       1910635
8     Johnson High School       3094650
9        Pena High School        585858
10  Rodriguez High School       2547363
11    Shelton High School       1056600
12     Thomas High School       1043130
13     Wilson High School       1319574
14     Wright High School       1049400

  District Type  Total Budget
0       Charter       7301505
1      District      17347923

In [41]:
# Calculate the average test scores per school from school_data_complete
per_school_math = Schools_df.groupby('school_name')['math_score'].mean().reset_index()

per_school_reading = Schools_df.groupby('school_name')['reading_score'].mean(). reset_index()


Per_school_avg = pd.merge(per_school_math, per_school_reading, on='school_name')

Per_school_avg.columns = ['School Name', 'Math Average', 'Reading Average']

Per_school_avg

              School Name  Math Average  Reading Average
0      Bailey High School     77.048432        81.033963
1     Cabrera High School     83.061895        83.975780
2    Figueroa High School     76.711767        81.158020
3        Ford High School     77.102592        80.746258
4     Griffin High School     83.351499        83.816757
5   Hernandez High School     77.289752        80.934412
6      Holden High School     83.803279        83.814988
7       Huang High School     76.629414        81.182722
8     Johnson High School     77.072464        80.966394
9        Pena High School     83.839917        84.044699
10  Rodriguez High School     76.842711        80.744686
11    Shelton High School     83.359455        83.725724
12     Thomas High School     83.418349        83.848930
13     Wilson High School     83.274201        83.989488
14     Wright High School     83.682222        83.955000

In [74]:
# Calculate the number of students per school with math scores of 70 or higher from school_data_complete
# Lets us a previously set Variable Pass for this...

# Create Boolean to determine passing or fail....
Schools_df['passing_math'] = Schools_df['math_score'] >= Pass

# Sum up how many students are passing...PERIOD...then print to verify
students_passing_math = pass_math.sum()

# Sum up how many are passing PER school...then print
school_students_passing_math = Schools_df.groupby('school_name')['passing_math'].sum().reset_index()


# What did you get? Yea, me too
print(students_passing_math)
school_students_passing_math

29370

              school_name  passing_math
0      Bailey High School          3318
1     Cabrera High School          1749
2    Figueroa High School          1946
3        Ford High School          1871
4     Griffin High School          1371
5   Hernandez High School          3094
6      Holden High School           395
7       Huang High School          1916
8     Johnson High School          3145
9        Pena High School           910
10  Rodriguez High School          2654
11    Shelton High School          1653
12     Thomas High School          1525
13     Wilson High School          2143
14     Wright High School          1680

In [73]:
# Using the same Pass variable previously set for Reading. Everything for Math...applies here

# Create Boolean to determine passing or fail....
Schools_df['passing_reading'] = Schools_df['reading_score'] >= Pass

# Sum up how many students are passing...PERIOD...then print to verify
students_passing_reading = read_pass.sum()

# Sum up how many are passing PER school...then print
school_students_passing_reading = Schools_df.groupby('school_name')['passing_reading'].sum().reset_index()

# What did you get? Yea, me too
print(students_passing_reading)
school_students_passing_reading

33610

              school_name  passing_reading
0      Bailey High School             4077
1     Cabrera High School             1803
2    Figueroa High School             2381
3        Ford High School             2172
4     Griffin High School             1426
5   Hernandez High School             3748
6      Holden High School              411
7       Huang High School             2372
8     Johnson High School             3867
9        Pena High School              923
10  Rodriguez High School             3208
11    Shelton High School             1688
12     Thomas High School             1591
13     Wilson High School             2204
14     Wright High School             1739

In [77]:
# Lets merge our data for easy reading
Passing_math_read = pd.merge(school_students_passing_math, school_students_passing_reading, on='school_name')
Passing_math_read.columns = ['School Name', '# Passing Math', '#Passing Reading']

Passing_math_read

              School Name  # Passing Math  #Passing Reading
0      Bailey High School            3318              4077
1     Cabrera High School            1749              1803
2    Figueroa High School            1946              2381
3        Ford High School            1871              2172
4     Griffin High School            1371              1426
5   Hernandez High School            3094              3748
6      Holden High School             395               411
7       Huang High School            1916              2372
8     Johnson High School            3145              3867
9        Pena High School             910               923
10  Rodriguez High School            2654              3208
11    Shelton High School            1653              1688
12     Thomas High School            1525              1591
13     Wilson High School            2143              2204
14     Wright High School            1680              1739

In [ ]:
# Using the same Pass variable previously set for Reading. Everything for Math...applies here

# Create Boolean to determine passing or fail....
Schools_df['passing_reading'] = Schools_df['reading_score'] >= Pass

# Sum up how many students are passing...PERIOD...then print to verify
students_passing_reading = read_pass.sum()

# Sum up how many are passing PER school...then print
school_students_passing_reading = Schools_df.groupby('school_name')['passing_reading'].sum().reset_index()
school_students_passing_reading.columns = ['School Name', '# of Students Passing']

# What did you get? Yea, me too
print(students_passing_reading)
school_students_passing_reading

In [68]:
# Use the provided code to calculate the number of students per school that passed both math and reading with scores of 70 or higher

students_passing_math_reading_count= passing_math_reading_count

school_students_passing_math_and_reading = students_passing_math_reading_count.groupby(["school_name"]).size()
school_students_passing_math_and_reading.columns = ['School Name', '# of Students Passing']

print(students_passing_math_and_reading)
school_students_passing_math_and_reading

25528

school_name
Bailey High School       2719
Cabrera High School      1697
Figueroa High School     1569
Ford High School         1487
Griffin High School      1330
Hernandez High School    2481
Holden High School        381
Huang High School        1561
Johnson High School      2549
Pena High School          871
Rodriguez High School    2119
Shelton High School      1583
Thomas High School       1487
Wilson High School       2068
Wright High School       1626
dtype: int64

In [57]:
passing_math_reading_count = Schools_df[(Schools_df["math_score"] >= 70) & (Schools_df["reading_score"] >= 70)
]
passing_math_reading_count
#  overall_passing_rate = passing_math_reading_count /  float(Total_students) * 100
# overall_passing_rate
# # % overall passing
# print(overall_passing_rate)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,passing_math,passing_reading
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635,True,True
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635,True,True
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635,True,True
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635,True,True
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130,True,True
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130,True,True
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130,True,True
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130,True,True
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130,True,True

In [ ]:
# Use the provided code to calculate the passing rates
per_school_passing_math = school_students_passing_math / per_school_counts * 100
per_school_passing_reading = school_students_passing_reading / per_school_counts * 100
overall_passing_rate = school_students_passing_math_and_reading / per_school_counts * 100

In [ ]:
# Create a DataFrame called `per_school_summary` with columns for the calculations above.
per_school_summary =

# Formatting
per_school_summary["Total School Budget"] = per_school_summary["Total School Budget"].map("${:,.2f}".format)
per_school_summary["Per Student Budget"] = per_school_summary["Per Student Budget"].map("${:,.2f}".format)

# Display the DataFrame
per_school_summary

In [ ]:
# Create a DataFrame called `per_school_summary` with columns for the calculations above.
per_school_summary =

# Formatting
per_school_summary["Total School Budget"] = per_school_summary["Total School Budget"].map("${:,.2f}".format)
per_school_summary["Per Student Budget"] = per_school_summary["Per Student Budget"].map("${:,.2f}".format)

# Display the DataFrame
per_school_summary

In [ ]:
 
# Highest Performing schools by % overall passing
# Sort schools by % overall passing in descending order and display the top 5 rows.
# Save results in a dataframe called "top_schools"

In [ ]:

# Lowest performing schools by % overall passing
# Sort the shool by % overall passing in ascending order and display the top 5 rows. Save results in a dataframe called "bottm_schools"

In [ ]:

# Math scored by grade
# Perform the necessary calculations to create a datafram that lists the average the math score for students of each grade level (9th,10th, 11th, 12th) at each schoo

In [ ]:
# Reading scores by grade
# create a datafram that lists the average reading score for students of each grade level (9th, 10,11, 12) at each school